// @strict-types


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("МассивОбъектов", Элементы.Список.ВыделенныеСтроки);
	НачатьИзменениеВыделенных(ПараметрыКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункцииКлиент

&НаКлиенте
Процедура НачатьИзменениеВыделенных(ПараметрыГрупповогоИзменения)
	
	Если НЕ ПараметрыГрупповогоИзменения.МассивОбъектов.Количество() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
	Иначе
		ОткрытьФорму("Обработка.ГрупповоеИзменениеРеквизитов.Форма", ПараметрыГрупповогоИзменения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
