///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получить значение константы по имени.
// 
// Параметры:
//  ИмяКонстанты - Строка - Имя константы
// 
// Возвращаемое значение:
//  Неопределено, Произвольный - Получить значение константы по имени
Функция ПолучитьЗначениеКонстантыПоИмени(Знач ИмяКонстанты = "") Экспорт
	
	Если ПустаяСтрока(ИмяКонстанты) Тогда
		Результат = Неопределено;
	Иначе
		Результат = Константы[ИмяКонстанты].Получить();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
