///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет запись события в регистр сведений.
//
// Параметры:
//  Событие					 - Структура - Структура полей записи регистра сведений.
//  ДополнительныеПараметры	 - Структура - Дополнительные параметры выполнения процедуры.
//
Процедура ЗаписатьСобытие(Событие, ДополнительныеПараметры = Неопределено) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Событие);
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.МоментВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

// Функция возвращает все поля события в виде структуры.
// 
// Параметры:
//  ДополнительныеПараметры - Структура - Дополнительные параметры выполнения функции.
// 
// Возвращаемое значение:
//  Структура - Структура полей.
//@skip-check constructor-function-return-section
Функция СтруктураСобытия(ДополнительныеПараметры = Неопределено) Экспорт
	
	СтруктураПолейСобытия = Новый Структура;
	
	СтруктураПолейСобытия.Вставить("ТипСобытия");
	СтруктураПолейСобытия.Вставить("ЭкземплярДоступа");
	СтруктураПолейСобытия.Вставить("ВидДанных");
	СтруктураПолейСобытия.Вставить("Свойство");
	
	Возврат СтруктураПолейСобытия;
	
КонецФункции

#КонецОбласти

#КонецЕсли
