///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ВидФормыНастройки", ЛОЖЬ) Тогда
		ВыбраннаяФорма = "ФормаНастроек_";
	Иначе
		ВыбраннаяФорма = "Форма_";
	КонецЕсли;
	Если Константы.СтильИнтерфейсаМоиПароли.Получить() = Перечисления.СтилиИнтерфейсаМоиПароли.Классический Тогда
		ВыбраннаяФорма = ВыбраннаяФорма + "КлассическийСтиль";
	Иначе
		ВыбраннаяФорма = ВыбраннаяФорма + "СовременныйСтиль";
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
