// @strict-types

//@skip-check optional-form-parameter-access
//@skip-check module-structure-form-event-regions
//@skip-check invocation-parameter-type-intersect
//@skip-check typed-value-adding-to-untyped-collection
//@skip-check statement-type-change
//@skip-check module-unused-local-variable
//@skip-check variable-value-type
//@skip-check property-return-type
//@skip-check dynamic-access-method-not-found
//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
//@skip-check structure-consructor-value-type
//@skip-check function-return-value-type
//@skip-check bsl-legacy-check-method-for-statements-after-return
//@skip-check reading-attribute-from-database


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Найти = Параметры.ЗаменяемыйОбъект;
	НайтиИсходящие();
	НайтиВходящие();
	ТипНайти();
	
	Если ЗначениеЗаполнено(Параметры.ЗаменительОбъект) Тогда
		Заменить = Параметры.ЗаменительОбъект;
	КонецЕсли;
	
	Элементы.ОтключитьКонтрольКорректностиПриЗаписи.Видимость = ПравоДоступа("АдминистрированиеДанных", Метаданные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура НайтиПриИзмененииНаСервере()
	ТипНайти();
	НайтиИсходящие();
	НайтиВходящие();
КонецПроцедуры

&НаКлиенте
Процедура НайтиПриИзменении(Элемент)
	НайтиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяВОбъектахФлажокПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ИспользуетсяВОбъектах.ТекущаяСтрока;
	Если ИДТекущейСтроки <> Неопределено Тогда		
		ЭлементКоллекции = ИспользуетсяВОбъектах.НайтиПоИдентификатору(ИДТекущейСтроки);
		Если ЭлементКоллекции.Флажок = 2 Тогда
			ЭлементКоллекции.Флажок = 0;
		ИначеЕсли ЭлементКоллекции.Флажок = 0 Тогда
			ЭлементКоллекции.Флажок = 1;
		КонецЕсли;
		УстановкаФлажков(ЭлементКоллекции, ЭлементКоллекции.Флажок);
		Родитель = ЭлементКоллекции.ПолучитьРодителя();
		Пока Родитель <> Неопределено Цикл
			Родитель.Флажок = ?(УстановленоДляВсех(ЭлементКоллекции), ЭлементКоллекции.Флажок, 2);
			ЭлементКоллекции = Родитель;
			Родитель = ЭлементКоллекции.ПолучитьРодителя();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИспользуетсяВОбъектах

&НаКлиенте
Процедура ИспользуетсяВОбъектахПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяВОбъектахПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПомеченныеНаУдаление

&НаКлиенте
Процедура ПомеченныеНаУдалениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекОбъект = Элемент.ТекущиеДанные.Объект;
	Если ТипЗнч(ТекОбъект) <> Тип("Строка") Тогда
		ПоказатьЗначение(,ТекОбъект);
	Иначе
		Если Элементы.ПомеченныеНаУдаление.Развернут(ВыбраннаяСтрока) Тогда
			Элементы.ПомеченныеНаУдаление.Свернуть(Элемент.ТекущаяСтрока);
		Иначе
			Элементы.ПомеченныеНаУдаление.Развернуть(Элемент.ТекущаяСтрока, Истина);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПомеченныеНаУдалениеПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные<>Неопределено Тогда
		Элементы.ПомеченныеНаУдалениеЗаменитьОбъект.Доступность = ТипЗнч(Элемент.ТекущиеДанные.Объект) <> Тип("Строка");
		Элементы.ПомеченныеНаУдалениеКонтекстноеМенюЗаменитьОбъект.Доступность = ТипЗнч(Элемент.ТекущиеДанные.Объект) <> Тип("Строка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Поиск(Команда)
	Если ЗначениеЗаполнено(Найти) Тогда
		НайтиИсходящие();
		НайтиВходящие();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заданы параметры для поиска.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	Результат =Истина;
	Если Не ЗначениеЗаполнено(Найти) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заполнено поле поиска.'"));
		Результат = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Заменить) И Результат Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru='Для заменяемого объекта <%1> не указано значение замены.'"),
				Строка(Найти)));
		Результат = Ложь;
	КонецЕсли;
	
	Если Заменить = Найти И Результат Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru='Для заменяемого объекта <%1> указано одинаковое значение замены.'"),
				Строка(Найти)));
		Результат = Ложь;
	КонецЕсли;
	
	Если ПроверитьОтметкиВыбранныхОбъектов() И Результат Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбрано ни одного объекта для замены.'"));
		Результат = Ложь;
	КонецЕсли;
	
	Если Результат Тогда
		ЗаменитьОбъекты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаИспользуетсяВОбъектах" Тогда
		КоллекцияЭлементовДерева = ИспользуетсяВОбъектах.ПолучитьЭлементы();
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Элементы.ИспользуетсяВОбъектах.Свернуть(ИдентификаторСтроки);
		КонецЦикла;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаПомеченныеНаУдаление" Тогда
		КоллекцияЭлементовДерева = ПомеченныеНаУдаление.ПолучитьЭлементы();
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Элементы.ПомеченныеНаУдаление.Свернуть(ИдентификаторСтроки);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)
		Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаИспользуетсяВОбъектах" Тогда
		КоллекцияЭлементовДерева = ИспользуетсяВОбъектах.ПолучитьЭлементы();
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Элементы.ИспользуетсяВОбъектах.Развернуть(ИдентификаторСтроки);
		КонецЦикла;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаПомеченныеНаУдаление" Тогда
		КоллекцияЭлементовДерева = ПомеченныеНаУдаление.ПолучитьЭлементы();
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Элементы.ПомеченныеНаУдаление.Развернуть(ИдентификаторСтроки);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсе(Команда)
	КоллекцияЭлементовДерева=ИспользуетсяВОбъектах.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		Строка.Флажок = 1;
		ПодчиненныеЭлементыСтроки = Строка.ПолучитьЭлементы();
		Для Каждого ПодчиненнаяСтрока Из ПодчиненныеЭлементыСтроки Цикл
			ПодчиненнаяСтрока.Флажок = 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВсе(Команда)
	КоллекцияЭлементовДерева=ИспользуетсяВОбъектах.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		Строка.Флажок = 0;
		ПодчиненныеЭлементыСтроки = Строка.ПолучитьЭлементы();
		Для Каждого ПодчиненнаяСтрока Из ПодчиненныеЭлементыСтроки Цикл
			ПодчиненнаяСтрока.Флажок = 0;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьОбъект(Команда)
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаИспользуетОбъекты" Тогда
		Если Элементы.ИспользуетОбъекты.ТекущиеДанные <> Неопределено Тогда
			ЗаменяемыйОбъект = Элементы.ИспользуетОбъекты.ТекущиеДанные.Объект;
		КонецЕсли;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаПомеченныеНаУдаление" Тогда
		Если Элементы.ПомеченныеНаУдаление.ТекущиеДанные <> Неопределено И ТипЗнч(Элементы.ПомеченныеНаУдаление.ТекущиеДанные) <> Тип("Строка") Тогда
			ЗаменяемыйОбъект = Элементы.ПомеченныеНаУдаление.ТекущиеДанные.Объект;
		КонецЕсли;
	КонецЕсли;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗаменяемыйОбъект", ЗаменяемыйОбъект);
	
	ОткрытьФорму("Обработка.ПоискЗаменаЗначений.Форма",СтруктураПараметров,,Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НайтиВходящие()
	
	ИскомыйОбъект = Найти;
	
	Если ЗначениеЗаполнено(ИскомыйОбъект) Тогда
		
		СписокСсылокИспользует = Новый ТаблицаЗначений;
		СписокСсылокИспользует.Колонки.Добавить("Объект",Новый ОписаниеТипов(),"Объект");
		СписокСсылокИспользует.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"),"Тип");
		
		Если ИскомыйОбъект<>Неопределено Тогда
			ВидДок = ИскомыйОбъект.Метаданные().Имя;
			МассивТипов=Новый Массив;
			МассивТипов.Добавить(Тип("Строка"));
			МассивТипов.Добавить(Тип("Число"));
			МассивТипов.Добавить(Тип("Дата"));
			МассивТипов.Добавить(Тип("Булево"));
			ОписаниеТиповДок = Новый ОписаниеТипов(МассивТипов);
			
			Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ИскомыйОбъект)) Тогда
				КоллекцияРеквизитов = Новый Массив;
				Для Каждого ТекущийРеквизит Из ИскомыйОбъект.Метаданные().Реквизиты Цикл
					КоллекцияРеквизитов.Добавить(ТекущийРеквизит);
				КонецЦикла;
				Для Каждого Реквизит Из Метаданные.ОбщиеРеквизиты Цикл
					ЗначениеСостава = Реквизит.Состав.Найти(ИскомыйОбъект.Метаданные());
					Если ЗначениеСостава=Неопределено ИЛИ (НЕ ЗначениеСостава.Использование=Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать) Тогда
						Продолжить;
					КонецЕсли;
					КоллекцияРеквизитов.Добавить(Реквизит);
				КонецЦикла;
			ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ИскомыйОбъект)) Тогда
				КоллекцияРеквизитов = Новый Массив;
				Для Каждого ТекущийРеквизит Из ИскомыйОбъект.Метаданные().Реквизиты Цикл
					КоллекцияРеквизитов.Добавить(ТекущийРеквизит);
				КонецЦикла;
				Для Каждого Реквизит Из Метаданные.ОбщиеРеквизиты Цикл
					ЗначениеСостава = Реквизит.Состав.Найти(ИскомыйОбъект.Метаданные());
					Если ЗначениеСостава=Неопределено ИЛИ (НЕ ЗначениеСостава.Использование=Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать) Тогда
						Продолжить;
					КонецЕсли;
					КоллекцияРеквизитов.Добавить(Реквизит);
				КонецЦикла;
			ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗнч(ИскомыйОбъект))
				ИЛИ ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипЗнч(ИскомыйОбъект)) Тогда
				КоллекцияРеквизитов=ИскомыйОбъект.Метаданные().Реквизиты
			ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипЗнч(ИскомыйОбъект)) Тогда
				КоллекцияРеквизитов=ИскомыйОбъект.Метаданные().Реквизиты
			ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипЗнч(ИскомыйОбъект)) Тогда
				КоллекцияРеквизитов=ИскомыйОбъект.Метаданные().Реквизиты
			ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипЗнч(ИскомыйОбъект)) Тогда
				КоллекцияРеквизитов=ИскомыйОбъект.Метаданные().Реквизиты
			Иначе 
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Поиск по данному типу ссылки не определен.'"));
				Возврат;
			КонецЕсли;
			Для Каждого Реквизит Из КоллекцияРеквизитов Цикл
				ЗначениеРеквизита = ИскомыйОбъект[Реквизит.Имя];
				Если ЗначениеЗаполнено(ЗначениеРеквизита) И (Не ОписаниеТиповДок.СодержитТип(ТипЗнч(ЗначениеРеквизита))) Тогда
					Строка = СписокСсылокИспользует.Добавить();
					Строка.Объект = ЗначениеРеквизита;
					Строка.Тип = ТипЗнч(ЗначениеРеквизита);
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
		ИспользуетОбъекты.Очистить();
		ИспользуетОбъекты.Загрузить(СписокСсылокИспользует);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НайтиИсходящие()
	
	ИскомыйОбъект = Найти;
	
	Если ЗначениеЗаполнено(ИскомыйОбъект) Тогда
		ДеревоЗнач = РеквизитФормыВЗначение("ИспользуетсяВОбъектах",Тип("ДеревоЗначений"));
		ДеревоЗнач.Строки.Очистить();
		МассивПоиска=Новый Массив(1);
		МассивПоиска[0]=ИскомыйОбъект;
		ТаблицаСсылок = НайтиПоСсылкам(МассивПоиска);
		Для Каждого ТекСсылка Из ТаблицаСсылок Цикл
			Если ДеревоЗнач.Строки.Найти(Строка(ТекСсылка.Метаданные)) = Неопределено Тогда
				Если ТекСсылка.Данные = Неопределено Тогда
					Если ДеревоЗнач.Строки.Найти("Константы") = Неопределено Тогда
						КорневаяСтрока = ДеревоЗнач.Строки.Добавить();
						КорневаяСтрока.Ссылка = "Константы";
					Иначе
						КорневаяСтрока = ДеревоЗнач.Строки.Найти("Константы");
					КонецЕсли;
					
					НоваяСтрока = КорневаяСтрока.Строки.Добавить();
					НоваяСтрока.Ссылка            = Строка(ТекСсылка.Метаданные);
					КорневаяСтрока.ИндексКартинки = ПолучитьИндексКартинкиВидаОбъектаМетаданных(ТекСсылка.Метаданные);
					НоваяСтрока.ИндексКартинки    = КорневаяСтрока.ИндексКартинки;
					НоваяСтрока.ПолноеИмяОбъекта  = ТекСсылка.Метаданные.ПолноеИмя();
					Продолжить;
				КонецЕсли;
				
				КорневаяСтрока = ДеревоЗнач.Строки.Добавить();
				КорневаяСтрока.Ссылка = Строка(ТекСсылка.Метаданные);
				
				НоваяСтрока = КорневаяСтрока.Строки.Добавить();
				НоваяСтрока.Ссылка            = Строка(ТекСсылка.Данные);
				НоваяСтрока.Объект            = ТекСсылка.Данные;
				КорневаяСтрока.ИндексКартинки = ПолучитьИндексКартинкиВидаОбъектаМетаданных(ТекСсылка.Метаданные);
				НоваяСтрока.ИндексКартинки    = КорневаяСтрока.ИндексКартинки;
				НоваяСтрока.ПолноеИмяОбъекта  = ТекСсылка.Метаданные.ПолноеИмя();
			Иначе
				НайденнаяСтрока = ДеревоЗнач.Строки.Найти(Строка(ТекСсылка.Метаданные));
				НоваяСтрока = НайденнаяСтрока.Строки.Добавить();
				НоваяСтрока.Ссылка           = Строка(ТекСсылка.Данные);
				НоваяСтрока.Объект           = ТекСсылка.Данные;
				НоваяСтрока.ИндексКартинки   = ПолучитьИндексКартинкиВидаОбъектаМетаданных(ТекСсылка.Метаданные);
				НоваяСтрока.ПолноеИмяОбъекта = ТекСсылка.Метаданные.ПолноеИмя();
			КонецЕсли;
		КонецЦикла;
		
		ДеревоЗнач.Строки.Сортировать("ИндексКартинки Возр, Ссылка Возр");
		ЗначениеВРеквизитФормы(ДеревоЗнач,"ИспользуетсяВОбъектах");
		
		КоллекцияЭлементовДерева=ИспользуетсяВОбъектах.ПолучитьЭлементы();
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
			КоличествоПоз = Строка.ПолучитьЭлементы().Количество();
			Строка.Ссылка = Строка.Ссылка + " (" + КоличествоПоз + ")";
		КонецЦикла;
	КонецЕсли;
	
	МоиПаролиСервер.РегистрацияСобытия("ПоискЗаменаЗначений");
	
КонецПроцедуры

&НаСервере
Процедура ТипНайти()
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(ТипЗнч(Найти));
	Элементы.ИскомоеЗначение.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	Заменить = Элементы.ИскомоеЗначение.ОграничениеТипа.ПривестиЗначение(Заменить);
КонецПроцедуры

&НаСервере
Функция ПроверитьОтметкиВыбранныхОбъектов()
	ДеревоЗнач = РеквизитФормыВЗначение("ИспользуетсяВОбъектах",Тип("ДеревоЗначений"));
	ОтборСтрока = Новый Структура;
	ОтборСтрока.Вставить("Флажок", 1);
	Если ДеревоЗнач.Строки.НайтиСтроки(ОтборСтрока, Истина).Количество() = 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ЗаменитьОбъекты()
	ПравильныйЭлемент = Заменить;
	ДеревоЗначений = РеквизитФормыВЗначение("ИспользуетсяВОбъектах",Тип("ДеревоЗначений"));
	ОтборСтрока = Новый Структура;
	ОтборСтрока.Вставить("Флажок", 1);
	МассивОбъектовДляЗамены = ДеревоЗначений.Строки.НайтиСтроки(ОтборСтрока, Истина);
	
	СтруктураПараметры = Новый Структура;
	Для Каждого РегистрБухгалтерии Из Метаданные.РегистрыБухгалтерии Цикл
		СтруктураПараметры.Вставить(РегистрБухгалтерии.Имя+"Субконто", РегистрБухгалтерии.ПланСчетов.МаксКоличествоСубконто);
		СтруктураПараметры.Вставить(РегистрБухгалтерии.Имя+"Корреспонденция", РегистрБухгалтерии.Корреспонденция);
	КонецЦикла;
	СтруктураПараметры.Вставить("Объект", Неопределено);
	
	Результат = Истина;
	Для Каждого ТекЭлемент Из МассивОбъектовДляЗамены Цикл
		Если ТекЭлемент.Родитель <> Неопределено Тогда
			Ссылка = Найти;
			ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ТекЭлемент.ПолноеИмяОбъекта);
			
			Если Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
				
				Результат = ПоискЗаменаЗначенийСервер.ИзменитьДокумент(ТекЭлемент.Объект.ПолучитьОбъект(),Ссылка, ПравильныйЭлемент, ОтключитьКонтрольКорректностиПриЗаписи) И Результат;
				
			ИначеЕсли Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
				
				Результат = ПоискЗаменаЗначенийСервер.ИзменитьСправочник(ТекЭлемент.Объект.ПолучитьОбъект(),Ссылка, ПравильныйЭлемент, ОтключитьКонтрольКорректностиПриЗаписи) И Результат;
				
			ИначеЕсли Метаданные.Константы.Содержит(ОбъектМетаданных) Тогда
				
				Результат = ПоискЗаменаЗначенийСервер.ИзменитьКонстанту(ОбъектМетаданных, ПравильныйЭлемент) И Результат;
			
			ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных)
				ИЛИ Метаданные.ПланыСчетов.Содержит(ОбъектМетаданных)
				ИЛИ Метаданные.ПланыВидовРасчета.Содержит(ОбъектМетаданных)
				ИЛИ Метаданные.Задачи.Содержит(ОбъектМетаданных)
				ИЛИ Метаданные.БизнесПроцессы.Содержит(ОбъектМетаданных) Тогда
				
				Результат = ПоискЗаменаЗначенийСервер.ИзменитьДругиеОбъекты(ТекЭлемент.Объект.ПолучитьОбъект(),Ссылка,ПравильныйЭлемент, ОтключитьКонтрольКорректностиПриЗаписи) И Результат;
				
			ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда	
				
				Результат = ПоискЗаменаЗначенийСервер.ИзменитьРегистрСведений(ОбъектМетаданных,ТекЭлемент.Объект, Ссылка, ПравильныйЭлемент) И Результат;
				
			Иначе
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Ссылки типа %1 не заменяются.'"), ТекЭлемент.Ссылка));
			КонецЕсли;
		КонецЕсли;
		Если Не Результат Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Объект %1 не удалось записать.'"), ТекЭлемент.Ссылка));
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПометитьНаУдаление Тогда
		ОбъектДляУдаления = Ссылка.ПолучитьОбъект();
		Если (ОбъектДляУдаления <> Неопределено) И (Не Ссылка.ПометкаУдаления) Тогда
			ОбъектДляУдаления = Ссылка.ПолучитьОбъект();
			Предопределенный = Ложь;
			Если ОбщегоНазначения.ЭтоСправочник(ОбъектДляУдаления.Метаданные()) Или ОбщегоНазначения.ЭтоПланВидовХарактеристик(ОбъектДляУдаления.Метаданные())
				Или ОбщегоНазначения.ЭтоПланСчетов(ОбъектДляУдаления.Метаданные()) Или ОбщегоНазначения.ЭтоПланВидовРасчета(ОбъектДляУдаления.Метаданные()) Тогда
				Если ОбъектДляУдаления.Предопределенный Тогда
					ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Предопределенный элемент невозможно пометить на удаление.'"));
					Предопределенный = Истина;
				КонецЕсли;
			КонецЕсли;
			Если Не Предопределенный Тогда
				ОбъектДляУдаления.УстановитьПометкуУдаления(Истина);
				ОбъектДляУдаления.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	НайтиИсходящие();
	НайтиВходящие();
КонецФункции

&НаСервере
Процедура ДеревоПомеченныеНаУдаление()
	ДеревоЗнач = РеквизитФормыВЗначение("ПомеченныеНаУдаление",Тип("ДеревоЗначений"));
	Если ДеревоЗнач.Строки.Количество() = 0 Тогда
		ДеревоЗнач.Строки.Очистить();
		ПомеченныеОбъекты = НайтиПомеченныеНаУдаление();
		Для Каждого ПомеченныйЭлемент Из ПомеченныеОбъекты  Цикл
			
			Если ДеревоЗнач.Строки.Найти(Строка(ПомеченныйЭлемент.Метаданные())) = Неопределено Тогда
				КорневаяСтрока = ДеревоЗнач.Строки.Добавить();
				КорневаяСтрока.Объект = Строка(ПомеченныйЭлемент.Метаданные());
				
				НоваяСтрока = КорневаяСтрока.Строки.Добавить();
				НоваяСтрока.Объект            = ПомеченныйЭлемент;
				КорневаяСтрока.ИндексКартинки = ПолучитьИндексКартинкиВидаОбъектаМетаданных(ПомеченныйЭлемент.Метаданные());
				НоваяСтрока.ИндексКартинки    = КорневаяСтрока.ИндексКартинки;
			Иначе
				НайденнаяСтрока = ДеревоЗнач.Строки.Найти(Строка(ПомеченныйЭлемент.Метаданные()));
				НоваяСтрока = НайденнаяСтрока.Строки.Добавить();
				НоваяСтрока.Объект         = ПомеченныйЭлемент;
				НоваяСтрока.ИндексКартинки = ПолучитьИндексКартинкиВидаОбъектаМетаданных(ПомеченныйЭлемент.Метаданные());
			КонецЕсли;
			
		КонецЦикла;
		
		ДеревоЗнач.Строки.Сортировать("ИндексКартинки Возр, Объект Возр");
		ЗначениеВРеквизитФормы(ДеревоЗнач,"ПомеченныеНаУдаление");
		КоллекцияЭлементовДерева=ПомеченныеНаУдаление.ПолучитьЭлементы();
		
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
			КоличествоПоз = Строка.ПолучитьЭлементы().Количество();
			Строка.Объект = Строка.Объект + " (" + КоличествоПоз + ")";
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФлажков(ЭлементКоллекции, ЗначениеПометки)
	ПодчиненныеЭлементыСтроки = ЭлементКоллекции.ПолучитьЭлементы();
	Для Каждого ТекЭлемент Из ПодчиненныеЭлементыСтроки Цикл
		ТекЭлемент.Флажок = ЗначениеПометки;
		УстановкаФлажков(ТекЭлемент, ТекЭлемент.Флажок);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция УстановленоДляВсех(ЭлементКоллекции)
	СоседниеЭлементы = ЭлементКоллекции.ПолучитьРодителя().ПолучитьЭлементы();
	Для Каждого ТекЭлемент Из СоседниеЭлементы Цикл
		Если ТекЭлемент.Флажок <> ЭлементКоллекции.Флажок Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ИспользуетсяВОбъектахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекОбъект = Элемент.ТекущиеДанные.Объект;
	Если ТекОбъект <> Неопределено Тогда
		ПоказатьЗначение(,ТекОбъект);
	Иначе
		
		Если Элементы.ИспользуетсяВОбъектах.Развернут(ВыбраннаяСтрока) Тогда
			Элементы.ИспользуетсяВОбъектах.Свернуть(Элемент.ТекущаяСтрока);
		Иначе
			Элементы.ИспользуетсяВОбъектах.Развернуть(Элемент.ТекущаяСтрока, Истина);
		КонецЕсли; 
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекОбъект = Элемент.ТекущиеДанные.Объект;
	Если ТекОбъект <> Неопределено Тогда
		ПоказатьЗначение(,ТекОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "СтраницаПомеченныеНаУдаление" Тогда
		ДеревоПомеченныеНаУдаление();
	КонецЕсли;
КонецПроцедуры

// Функция возвращает индекс картинки для переданного объекта метаданных
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - Переданный объект метаданных
// 
// Возвращаемое значение:
//  Число - Индекс картинки объекта.
//
&НаСервере
Функция ПолучитьИндексКартинкиВидаОбъектаМетаданных(ОбъектМетаданных) Экспорт
	Индекс = 0;
	Если ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
		Индекс = 4;
	ИначеЕсли ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
		Индекс = 5;
	ИначеЕсли ОбщегоНазначения.ЭтоПеречисление(ОбъектМетаданных) Тогда
		Индекс = 7;
	ИначеЕсли ОбщегоНазначения.ЭтоПланОбмена(ОбъектМетаданных) Тогда
		Индекс = 10;
	ИначеЕсли ОбщегоНазначения.ЭтоПланВидовХарактеристик(ОбъектМетаданных) Тогда
		Индекс = 11;
	ИначеЕсли ОбщегоНазначения.ЭтоБизнесПроцесс(ОбъектМетаданных) Тогда
		Индекс = 18;
	ИначеЕсли ОбщегоНазначения.ЭтоЗадача(ОбъектМетаданных) Тогда
		Индекс = 19;
	ИначеЕсли ОбщегоНазначения.ЭтоПланСчетов(ОбъектМетаданных) Тогда
		Индекс = 12;
	ИначеЕсли ОбщегоНазначения.ЭтоПланВидовРасчета(ОбъектМетаданных) Тогда
		Индекс = 13;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(ОбъектМетаданных) Тогда
		Индекс = 14;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрНакопления(ОбъектМетаданных) Тогда
		Индекс = 15;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрБухгалтерии(ОбъектМетаданных) Тогда
		Индекс = 16;
	ИначеЕсли ОбщегоНазначения.ЭтоРегистрРасчета(ОбъектМетаданных) Тогда
		Индекс = 17;
	ИначеЕсли ОбщегоНазначения.ЭтоКонстанта(ОбъектМетаданных) Тогда
		Индекс = 3;
	ИначеЕсли ОбщегоНазначения.ЭтоЖурналДокументов(ОбъектМетаданных) Тогда
		Индекс = 6;
	КонецЕсли;
	
	Возврат Индекс;
КонецФункции

#КонецОбласти

